# RebarUpdateCurvesData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData Class
Members See Also
---
Class holding the information needed to calculate the rebar curves.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarUpdateCurvesData : IDisposable
```

Visual Basic
---
```text
Public Class RebarUpdateCurvesData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarUpdateCurvesData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarUpdateCurvesData
# See Also
RebarUpdateCurvesData Members
Autodesk.Revit.DB.Structure Namespace